In [1]:
'''Create a Pandas Series from a Python list [10,20,30,40,50] with custom indexes ['a','b','c','d','e'].

Retrieve element 'c'.

Slice from 'b' to 'd'.'''
import pandas as pd

given_list = [10,20,30,40,50]
series = pd.Series(given_list,index = ['a','b','c','d','e'] )
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [3]:
print(series["c"])

30

In [6]:
series.loc['b':'d']

b    20
c    30
d    40
dtype: int64

In [8]:
series.iloc[1:4]

b    20
c    30
d    40
dtype: int64

In [13]:
'''Create a DataFrame with columns: Name, Age, City. Fill it with 5 rows of data.

Select the Age column as a Series.

Select rows where Age > 25.

Retrieve the first 3 rows.'''

name = ['alice','bob','charlie','david','eve']
age = [10,20,30,40,50]
city = ['A','B','C','D','E']

details = {"name":name,
          "age":age,
          "city":city}

table1 = pd.DataFrame(details)
print(table1)

      name  age city
0    alice   10    A
1      bob   20    B
2  charlie   30    C
3    david   40    D
4      eve   50    E
*******************
0    10
1    20
2    30
3    40
4    50
Name: age, dtype: int64

In [14]:
print(table1["age"])

0    10
1    20
2    30
3    40
4    50
Name: age, dtype: int64

In [15]:
table1[table1['age']>25]

      name  age city
2  charlie   30    C
3    david   40    D
4      eve   50    E

In [16]:
table1.query("age>25")

      name  age city
2  charlie   30    C
3    david   40    D
4      eve   50    E

In [17]:
table1.loc[0:2]

      name  age city
0    alice   10    A
1      bob   20    B
2  charlie   30    C

In [18]:
# it is question number 3

data = {"Product": ["A","B","C"], "Price":[100,200,150], "Quantity":[5,3,4]}

table1 = pd.DataFrame(data)
print(table1)

  Product  Price  Quantity
0       A    100         5
1       B    200         3
2       C    150         4

In [19]:
table1["total"] = table1["Price"]*table1["Quantity"]
print(table1)

  Product  Price  Quantity  total
0       A    100         5    500
1       B    200         3    600
2       C    150         4    600

In [23]:
'''Create a DataFrame with missing values (np.nan).

Fill missing values with the column mean.

Drop rows with more than 1 missing value.

Create a DataFrame with duplicate rows.

Drop duplicates.

Keep only the last occurrence of duplicates.

Rename column "Age" → "Years".

Replace all values Male → M, Female → F.'''


import numpy as np
data = {
    "ID": [1, 2, 2, 4, 5, 6, 7, 8],
    "Name": ["Alice", "Bob", "bob", "Charlie", None, "Eve", "Frank", "Grace"],
    "Age": [25, 30, 30, np.nan, 22, 29, None, 40],
    "Gender": ["Female", "Male", "male", "Male", "Female", None, "F", "M"],
    "City": ["New York", "los angeles", "Los Angeles", "Chicago", "New York", "Boston", "Boston", None],
    "Salary": [50000, 60000, 60000, 70000, None, 72000, 80000, 90000]
}

table1 = pd.DataFrame(data)
print(table1)

   ID     Name   Age  Gender         City   Salary
0   1    Alice  25.0  Female     New York  50000.0
1   2      Bob  30.0    Male  los angeles  60000.0
2   2      bob  30.0    male  Los Angeles  60000.0
3   4  Charlie   NaN    Male      Chicago  70000.0
4   5     None  22.0  Female     New York      NaN
5   6      Eve  29.0    None       Boston  72000.0
6   7    Frank   NaN       F       Boston  80000.0
7   8    Grace  40.0       M         None  90000.0

In [24]:
print(table1.isnull())

      ID   Name    Age  Gender   City  Salary
0  False  False  False   False  False   False
1  False  False  False   False  False   False
2  False  False  False   False  False   False
3  False  False   True   False  False   False
4  False   True  False   False  False    True
5  False  False  False    True  False   False
6  False  False   True   False  False   False
7  False  False  False   False   True   False

In [27]:
table1["Salary"]=table1["Salary"].fillna(table1["Salary"].mean())
table1["Age"]=table1["Age"].fillna(table1["Age"].mean())
print(table1)

   ID     Name        Age  Gender         City        Salary
0   1    Alice  25.000000  Female     New York  50000.000000
1   2      Bob  30.000000    Male  los angeles  60000.000000
2   2      bob  30.000000    male  Los Angeles  60000.000000
3   4  Charlie  29.333333    Male      Chicago  70000.000000
4   5     None  22.000000  Female     New York  68857.142857
5   6      Eve  29.000000    None       Boston  72000.000000
6   7    Frank  29.333333       F       Boston  80000.000000
7   8    Grace  40.000000       M         None  90000.000000

In [30]:
table2 = table1.copy().dropna(thresh = len(table1.columns)-1)
print(table2)

   ID     Name        Age  Gender         City        Salary
0   1    Alice  25.000000  Female     New York  50000.000000
1   2      Bob  30.000000    Male  los angeles  60000.000000
2   2      bob  30.000000    male  Los Angeles  60000.000000
3   4  Charlie  29.333333    Male      Chicago  70000.000000
4   5     None  22.000000  Female     New York  68857.142857
5   6      Eve  29.000000    None       Boston  72000.000000
6   7    Frank  29.333333       F       Boston  80000.000000
7   8    Grace  40.000000       M         None  90000.000000

In [31]:
table3 = table1.copy().dropna()
print(table3)

   ID     Name        Age  Gender         City   Salary
0   1    Alice  25.000000  Female     New York  50000.0
1   2      Bob  30.000000    Male  los angeles  60000.0
2   2      bob  30.000000    male  Los Angeles  60000.0
3   4  Charlie  29.333333    Male      Chicago  70000.0
6   7    Frank  29.333333       F       Boston  80000.0

In [36]:
table4 = table1.copy()
table4["Name"] = table4["Name"].str.upper().str.strip()
table4["Gender"] = table4["Gender"].str.upper().str.strip()
table4["City"] = table4["City"].str.upper().str.strip()
print(table4)

   ID     Name        Age  Gender         City        Salary
0   1    ALICE  25.000000  FEMALE     NEW YORK  50000.000000
1   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
2   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
3   4  CHARLIE  29.333333    MALE      CHICAGO  70000.000000
4   5     None  22.000000  FEMALE     NEW YORK  68857.142857
5   6      EVE  29.000000    None       BOSTON  72000.000000
6   7    FRANK  29.333333       F       BOSTON  80000.000000
7   8    GRACE  40.000000       M         None  90000.000000

In [37]:
table4["Gender"]= table4["Gender"].replace({"M":"MALE","F":"FEMALE"})
print(table4)

   ID     Name        Age  Gender         City        Salary
0   1    ALICE  25.000000  FEMALE     NEW YORK  50000.000000
1   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
2   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
3   4  CHARLIE  29.333333    MALE      CHICAGO  70000.000000
4   5     None  22.000000  FEMALE     NEW YORK  68857.142857
5   6      EVE  29.000000    None       BOSTON  72000.000000
6   7    FRANK  29.333333  FEMALE       BOSTON  80000.000000
7   8    GRACE  40.000000    MALE         None  90000.000000

In [38]:
print(table4.duplicated())

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [40]:
table5 = table4.copy().drop_duplicates()
print(table5)

   ID     Name        Age  Gender         City        Salary
0   1    ALICE  25.000000  FEMALE     NEW YORK  50000.000000
1   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
3   4  CHARLIE  29.333333    MALE      CHICAGO  70000.000000
4   5     None  22.000000  FEMALE     NEW YORK  68857.142857
5   6      EVE  29.000000    None       BOSTON  72000.000000
6   7    FRANK  29.333333  FEMALE       BOSTON  80000.000000
7   8    GRACE  40.000000    MALE         None  90000.000000

In [43]:
table5 = table5.rename(columns = {"Age":"Years"})
print(table5)

   ID     Name      Years  Gender         City        Salary
0   1    ALICE  25.000000  FEMALE     NEW YORK  50000.000000
1   2      BOB  30.000000    MALE  LOS ANGELES  60000.000000
3   4  CHARLIE  29.333333    MALE      CHICAGO  70000.000000
4   5     None  22.000000  FEMALE     NEW YORK  68857.142857
5   6      EVE  29.000000    None       BOSTON  72000.000000
6   7    FRANK  29.333333  FEMALE       BOSTON  80000.000000
7   8    GRACE  40.000000    MALE         None  90000.000000

In [44]:
table5 = table5.dropna()
print(table5)

   ID     Name      Years  Gender         City   Salary
0   1    ALICE  25.000000  FEMALE     NEW YORK  50000.0
1   2      BOB  30.000000    MALE  LOS ANGELES  60000.0
3   4  CHARLIE  29.333333    MALE      CHICAGO  70000.0
6   7    FRANK  29.333333  FEMALE       BOSTON  80000.0